zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA365/startup_MCXA365.c
WEAK void Reserved106_IRQHandler(void)
{
    Reserved106_DriverIRQHandler();
}

WEAK void Reserved107_IRQHandler(void)
{
    Reserved107_DriverIRQHandler();
}

WEAK void Reserved108_IRQHandler(void)
{
    Reserved108_DriverIRQHandler();
}

WEAK void Reserved109_IRQHandler(void)
{
    Reserved109_DriverIRQHandler();
}

WEAK void Reserved110_IRQHandler(void)
{
    Reserved110_DriverIRQHandler();
}

WEAK void LPUART5_IRQHandler(void)
{
    LPUART5_DriverIRQHandler();
}

WEAK void Reserved112_IRQHandler(void)
{
    Reserved112_DriverIRQHandler();
}

WEAK void Reserved113_IRQHandler(void)
{
    Reserved113_DriverIRQHandler();
}

WEAK void Reserved114_IRQHandler(void)
{
    Reserved114_DriverIRQHandler();
}

WEAK void Reserved115_IRQHandler(void)
{
    Reserved115_DriverIRQHandler();
}

WEAK void Reserved116_IRQHandler(void)
{
    Reserved116_DriverIRQHandler();
}

WEAK void Reserved117_IRQHandler(void)
{
    Reserved117_DriverIRQHandler();
}

WEAK void Reserved118_IRQHandler(void)
{
    Reserved118_DriverIRQHandler();
}

WEAK void Reserved119_IRQHandler(void)
{
    Reserved119_DriverIRQHandler();
}

WEAK void Reserved120_IRQHandler(void)
{
    Reserved120_DriverIRQHandler();
}

WEAK void Reserved121_IRQHandler(void)
{
    Reserved121_DriverIRQHandler();
}

WEAK void Reserved122_IRQHandler(void)
{
    Reserved122_DriverIRQHandler();
}

WEAK void MAU_IRQHandler(void)
{
    MAU_DriverIRQHandler();
}

WEAK void SMARTDMA_IRQHandler(void)
{
    SMARTDMA_DriverIRQHandler();
}

WEAK void CDOG1_IRQHandler(void)
{
    CDOG1_DriverIRQHandler();
}

WEAK void PKC_IRQHandler(void)
{
    PKC_DriverIRQHandler();
}

WEAK void SGI_IRQHandler(void)
{
    SGI_DriverIRQHandler();
}

WEAK void Reserved128_IRQHandler(void)
{
    Reserved128_DriverIRQHandler();
}

WEAK void TRNG0_IRQHandler(void)
{
    TRNG0_DriverIRQHandler();
}

WEAK void SECURE_ERR_IRQHandler(void)
{
    SECURE_ERR_DriverIRQHandler();
}

WEAK void Reserved131_IRQHandler(void)
{
    Reserved131_DriverIRQHandler();
}

WEAK void ADC2_IRQHandler(void)
{
    ADC2_DriverIRQHandler();
}

WEAK void ADC3_IRQHandler(void)
{
    ADC3_DriverIRQHandler();
}

WEAK void Reserved134_IRQHandler(void)
{
    Reserved134_DriverIRQHandler();
}

WEAK void RTC_IRQHandler(void)
{
    RTC_DriverIRQHandler();
}

WEAK void RTC_1HZ_IRQHandler(void)
{
    RTC_1HZ_DriverIRQHandler();
}

WEAK void LCD_IRQHandler(void)
{
    LCD_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC pop_options
#endif //(__GNUC__)
#endif //(DEBUG)
